/*************************************************************************//*!

					@file	Chara.cpp
					@brief	キャラクタ基底クラス

															@author	いのうえ
															@date	2020.02.21
*//**************************************************************************/

//INCLUDE
#include "Chara.h"

namespace DxLibPlus
{
	// ********************************************************************************
	/// <summary>
	/// コンストラクタ
	/// </summary>
	/// <returns>None</returns>
	/// <created>いのうえ,2020/02/21</created>
	/// <changed>いのうえ,2020/02/21</changed>
	// ********************************************************************************
	CChara::CChara(void) :
		CGameAppBase(),
		m_AttackRate(1.0f),
		m_bDead(false),
		m_DamageWait(0),
		m_OffsetHp(0)
	{
		m_Status.hp = 0;
		m_Status.attack = 0;
	}
	// ********************************************************************************
	/// <summary>
	/// デストラクタ
	/// </summary>
	/// <returns>None</returns>
	/// <created>いのうえ,2020/02/21</created>
	/// <changed>いのうえ,2020/02/21</changed>
	// ********************************************************************************
	CChara::~CChara(void)
	{
	}
	// ********************************************************************************
	/// <summary>
	/// 読み込み
	/// </summary>
	/// <created>いのうえ,2020/02/21</created>
	/// <changed>いのうえ,2020/02/21</changed>
	// ********************************************************************************
	bool CChara::Load(void)
	{
		return true;
	}
	// ********************************************************************************
	/// <summary>
	/// 解放
	/// </summary>
	/// <created>いのうえ,2020/02/21</created>
	/// <changed>いのうえ,2020/02/21</changed>
	// ********************************************************************************
	void CChara::Release(void)
	{
	}
	// ********************************************************************************
	/// <summary>
	/// ダメージ処理
	/// </summary>
	/// <param name="dmg">ダメージ</param>
	/// <created>いのうえ,2020/02/21</created>
	/// <changed>いのうえ,2020/02/21</changed>
	// ********************************************************************************
	void CChara::Dmg(const int & dmg)
	{
		//体力を減らす
		m_Status.hp -= dmg;
		//ダメージ待ち時間の設定
		m_DamageWait = 60;
		//体力が０以下になれば死亡フラグを立てる
		if (m_Status.hp <= 0)
		{
			//体力が０以下にならないようにする
			m_Status.hp = 0;
			m_bDead = true;
		}
	}
	// ********************************************************************************
	/// <summary>
	/// 攻撃力取得
	/// </summary>
	/// <returns>攻撃力</returns>
	/// <created>いのうえ,2020/02/21</created>
	/// <changed>いのうえ,2020/02/21</changed>
	// ********************************************************************************
	int CChara::GetAttack(void) const
	{
		//素の攻撃力 * 攻撃倍率 * 0.8~1.2の乱数倍の結果を返す
		return static_cast<int>(m_Status.attack * m_AttackRate * (CDxLibUtilities::Random(8, 12) * 0.1f));
	}
	// ********************************************************************************
	/// <summary>
	/// 体力取得
	/// </summary>
	/// <returns>体力</returns>
	/// <created>いのうえ,2020/02/21</created>
	/// <changed>いのうえ,2020/02/21</changed>
	// ********************************************************************************
	int CChara::GetHp(void) const
	{
		return m_Status.hp;
	}
	// ********************************************************************************
	/// <summary>
	/// 死亡フラグの取得
	/// </summary>
	/// <returns>死亡フラグ</returns>
	/// <created>いのうえ,2020/02/21</created>
	/// <changed>いのうえ,2020/02/21</changed>
	// ********************************************************************************
	bool CChara::IsDead(void) const
	{
		return m_bDead;
	}
	// ********************************************************************************
	/// <summary>
	/// ダメージ待ち時間の取得
	/// </summary>
	/// <returns>ダメージ待ち時間</returns>
	/// <created>いのうえ,2020/02/21</created>
	/// <changed>いのうえ,2020/02/21</changed>
	// ********************************************************************************
	int CChara::GetDamageWait(void) const
	{
		return m_DamageWait;
	}
	// ********************************************************************************
	/// <summary>
	/// ダメージ待ち時間の更新
	/// </summary>
	/// <created>いのうえ,2020/02/21</created>
	/// <changed>いのうえ,2020/02/21</changed>
	// ********************************************************************************
	void CChara::RefreshDmg(void)
	{
		if (--m_DamageWait < 0)
		{
			m_DamageWait = 0;
		}
	}
}
