#pragma once
#include "GameAppBase.h"
#include "GameDefine.h"

namespace DxLibPlus
{
	class CChara : public CGameAppBase
	{
	protected:
		Status		m_Status;
	public:
		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CChara(void);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		~CChara(void);
		/*************************************************************************//*!
				@brief			初期化
				@param			None

				@return			None
		*//**************************************************************************/
		virtual void Initialize(void) = 0;
		/*************************************************************************//*!
				@brief			更新
				@param			None

				@return			None
		*//**************************************************************************/
		virtual void Update(void) = 0;
		/*************************************************************************//*!
				@brief			描画
				@param			None

				@return			None
		*//**************************************************************************/
		virtual void Render(void) = 0;
		/*************************************************************************//*!
				@brief			解放
				@param			None

				@return			None
		*//**************************************************************************/
		virtual void Release(void) override;

		void Dmg(const int& dmg);
		int GetAttack(void) const;
		int GetHp(void) const;
	};
}

