#pragma once
#include "GameAppBase.h"
#include "GameDefine.h"

namespace DxLibPlus
{
	// ********************************************************************************
	/// <summary>
	/// キャラクター基礎クラス
	/// </summary>
	// ********************************************************************************
	class CChara : public CGameAppBase
	{
	protected:
		Status		m_Status;		//!<ステータス
		float		m_AttackRate;
		bool		m_bDead;
		int			m_DamageWait;
		int			m_OffsetHp;
	public:
		// ********************************************************************************
		/// <summary>
		/// コンストラクタ
		/// </summary>
		/// <returns>None</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		CChara(void);
		// ********************************************************************************
		/// <summary>
		/// デストラクタ
		/// </summary>
		/// <returns>None</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		virtual ~CChara(void);
		// ********************************************************************************
		/// <summary>
		/// 読み込み
		/// </summary>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		virtual bool Load(void);
		// ********************************************************************************
		/// <summary>
		/// 初期化
		/// </summary>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		virtual void Initialize(void) = 0;
		// ********************************************************************************
		/// <summary>
		/// 更新
		/// </summary>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		virtual void Update(void) = 0;
		// ********************************************************************************
		/// <summary>
		/// 描画
		/// </summary>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		virtual void Render(void) = 0;
		// ********************************************************************************
		/// <summary>
		/// 解放
		/// </summary>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		virtual void Release(void) override;
		// ********************************************************************************
		/// <summary>
		/// ダメージ処理
		/// </summary>
		/// <param name="dmg">ダメージ</param>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		virtual void Dmg(const int& dmg);
		// ********************************************************************************
		/// <summary>
		/// 攻撃力取得
		/// </summary>
		/// <returns>攻撃力</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		int GetAttack(void) const;
		// ********************************************************************************
		/// <summary>
		/// 体力取得
		/// </summary>
		/// <returns>体力</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		int GetHp(void) const;

		bool IsDead(void) const;
		int GetDamageWait(void) const;
		void RefreshDmg(void);
	};
}

