/*****************************************************************************************************************************
 *
 *													FPSヘッダー
 *
 ****************************************************************************************************************************/
#pragma once
#include "Base.h"

/*****************************************************************************************************************************
 *
 *													FPSクラス
 *
 ****************************************************************************************************************************/
class Fps {
private:
	int					mStartTime;         //測定開始時刻
	int					mCount;             //カウンタ
	float				mFps;				//fps
	static const int	N = 60;				//平均を取るサンプル数
	static const int	FPS = 60;			//設定したFPS
	Fps();
	~Fps();
public:
	bool				Update();					//更新
	void				Draw();						//描画
	void				Wait();						//待ち
	float				GetFps() { return mFps; }	//FPS取得
	static Fps*			GetInstance() { static Fps obj; return &obj; }
};

#define	g_pFps	Fps::GetInstance()