/*************************************************************************//*!

					@file	GraphicsUtillities.h
					@brief	描画ユーティリティクラス

															@author	いのうえ
															@date	2020.02.14
*//**************************************************************************/

//ONCE
#pragma once

//INCLUDE
#include	"DxLib.h"
#include	<string>

namespace DxLibPlus
{
	// ********************************************************************************
	/// <summary>
	/// 描画ユーティリティクラス
	/// </summary>
	// ********************************************************************************
	class CGraphicsUtillities
	{
	private:
		//スタティッククラスにするためにコンストラクタ削除
		CGraphicsUtillities(void) = delete;
		~CGraphicsUtillities(void) = delete;
	public:
		// ********************************************************************************
		/// <summary>
		/// ウィンドウモード・フルスクリーンモードの変更を行う
		/// </summary>
		/// <param name="flag">ウィンドウモードで起動するかのフラグ情報</param>
		/// <returns>成功(DX_CHANGESCREEN_OK)or失敗</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		static int ChangeWindowMode(const int& flag);
		// ********************************************************************************
		/// <summary>
		/// ウィンドウのタイトルを変更する
		/// </summary>
		/// <param name="title">タイトル文字列</param>
		/// <returns>成功(0)か失敗(-1)</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		static int SetWindowTitle(const std::string& title);
		// ********************************************************************************
		/// <summary>
		/// ウィンドウのアイコンを変更する
		/// </summary>
		/// <param name="id">アイコンID</param>
		/// <returns>成功(0)か失敗(-1)</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		static int SetWindowIcon(const int& id);
		// ********************************************************************************
		/// <summary>
		/// ウィンドウのサイズを変更する
		/// </summary>
		/// <param name="w">横幅</param>
		/// <param name="h">縦幅</param>
		/// <returns>成功(0)か失敗(-1)</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		static int SetWindowSize(const int& w, const int& h);
		// ********************************************************************************
		/// <summary>
		/// フォントのサイズを変更する
		/// </summary>
		/// <param name="size">サイズ</param>
		/// <returns>成功(0)か失敗(-1)</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		static int SetFontSize(const int& size);
		// ********************************************************************************
		/// <summary>
		/// 画面のサイズ幅を取得する
		/// </summary>
		/// <returns>画面幅</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		static int GetTargetWidth(void);
		// ********************************************************************************
		/// <summary>
		/// 画面のサイズ縦を取得する
		/// </summary>
		/// <returns>画面高さ</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		static int GetTargetHeight(void);
		// ********************************************************************************
		/// <summary>
		/// 描画先グラフィック領域の指定
		/// </summary>
		/// <param name="screen">対象となるグラフィック領域を指定する</param>
		/// <returns>成功(0)か失敗(-1)</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		static int SetDrawScreen(const int& screen);
		// ********************************************************************************
		/// <summary>
		/// 画面に書かれたものを削除する
		/// </summary>
		/// <returns>成功(0)か失敗(-1)</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		static int ClearDrawScreen(void);
		// ********************************************************************************
		/// <summary>
		/// 画面裏に書かれたものを表に反映する
		/// </summary>
		/// <returns>成功(0)か失敗(-1)</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		static int ScreenFlip(void);
	};
}