/*************************************************************************//*!

					@file	KeyInput.h
					@brief	キー入力クラス

															@author	いのうえ
															@date	2020.02.21
*//**************************************************************************/

//ONCE
#pragma once

//INCLUDE
#include	"DxLib.h"

namespace DxLibPlus
{
	// ********************************************************************************
	/// <summary>
	/// キー入力クラス
	/// </summary>
	// ********************************************************************************
	class CKeyInput
	{
	private:
		bool m_Now[256];				//!<現在の入力バッファ
		bool m_Prev[256];				//!<１フレーム前の入力バッファ

		// ********************************************************************************
		/// <summary>
		/// コンストラクタ
		/// </summary>
		/// <returns>None</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		CKeyInput(void) = default;
		// ********************************************************************************
		/// <summary>
		/// デストラクタ
		/// </summary>
		/// <returns>None</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		~CKeyInput(void) = default;
	public:
		// ********************************************************************************
		/// <summary>
		/// キーマネージャー取得
		/// </summary>
		/// <returns>キーマネージャー</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		static CKeyInput& GetKeyInput(void);
		// ********************************************************************************
		/// <summary>
		/// キーの更新
		/// </summary>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		void RefreshKey(void);
		// ********************************************************************************
		/// <summary>
		/// 押した瞬間のフラグ取得
		/// </summary>
		/// <param name="keycode">キーコード</param>
		/// <returns>押された瞬間のフラグ</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		bool IsKeyPush(const int& keycode) const;
		// ********************************************************************************
		/// <summary>
		/// 押している間のフラグ取得
		/// </summary>
		/// <param name="keycode">キーコード</param>
		/// <returns>押している間のフラグ</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		bool IsKeyHold(const int& keycode) const;
		// ********************************************************************************
		/// <summary>
		/// キーから放した瞬間のフラグ取得
		/// </summary>
		/// <param name="keycode">キーコード</param>
		/// <returns>キーから放した瞬間のフラグ</returns>
		/// <created>いのうえ,2020/02/21</created>
		/// <changed>いのうえ,2020/02/21</changed>
		// ********************************************************************************
		bool IsKeyPull(const int& keycode) const;
	};
#define	theInput CKeyInput::GetKeyInput()
}

