/*************************************************************************//*!

					@file	TextureManager.h
					@brief	テクスチャ管理クラス

															@author	いのうえ
															@date	2020.02.15
*//**************************************************************************/

//ONCE
#pragma once

//INCLUDE
#include	"DxLib.h"
#include	<unordered_map>
#include	<string>

namespace DxLibPlus
{
	//STRUCT
	/*******************************//*!
	@brief	テクスチャ読み込み構造体

	@author	いのうえ
	*//********************************/
	typedef struct tag_TEXMNGINFO {
		std::string	key;	//!<検索用キー
		std::string	file;	//!<読み込みファイル名
	}TexMngInfo;

	/*******************************//*!
	@brief	テクスチャ管理クラス

	@author	いのうえ
	*//********************************/
	class CTextureManager
	{
	private:
		std::unordered_map<std::string, int>	m_GraphHandleList;	//!<グラフィックハンドル

		/*************************************************************************//*!
				@brief			コンストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		CTextureManager(void);
		/*************************************************************************//*!
				@brief			デストラクタ
				@param			None

				@return			None
		*//**************************************************************************/
		~CTextureManager(void);
	public:
		/*************************************************************************//*!
				@brief			マネージャー呼び出し
				@param			None

				@return			マネージャー
		*//**************************************************************************/
		static CTextureManager& GetTextureManager(void);
		/*************************************************************************//*!
				@brief			画像ファイルのハンドルを取得する
				@param[in]		name		登録キー名

				@return			-1			エラー発生<br>
								-1以外		グラフィックのハンドル
		*//**************************************************************************/
		int GetGraphHandle(const std::string& name);
		/*************************************************************************//*!
				@brief			画像ファイルの読み込み
				@param[in]		name		登録キー名
				@param[in]		fileName	画像ファイル名

				@return			-1			エラー発生<br>
								-1以外		グラフィックのハンドル
		*//**************************************************************************/
		int LoadGraph(const std::string& name, const std::string& fileName);
		/*************************************************************************//*!
				@brief			画像ファイルの横幅を取得する
				@param[in]		name		登録キー名

				@return			画像幅
		*//**************************************************************************/
		int GetWidth(const std::string& name) const;
		/*************************************************************************//*!
				@brief			画像ファイルの縦幅を取得する
				@param[in]		name		登録キー名

				@return			画像高さ
		*//**************************************************************************/
		int GetHeight(const std::string& name) const;
		/*************************************************************************//*!
				@brief			画像ファイルの一括読み込みする
				@param[in]		list		読み込みリスト
				@param[in]		cnt			リストの配列数

				@return			None
		*//**************************************************************************/
		void LoadList(TexMngInfo* list, const int& cnt);
	};

#define	theTextureManager	CTextureManager::GetTextureManager()
}